pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_bf.h
/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.DBGEN */
#define IFX_MCDSLIGHT_TCXDCSTS_DBGEN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.DBGEN */
#define IFX_MCDSLIGHT_TCXDCSTS_DBGEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.DBGEN */
#define IFX_MCDSLIGHT_TCXDCSTS_DBGEN_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.CLKDIV */
#define IFX_MCDSLIGHT_TCXDCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.CLKDIV */
#define IFX_MCDSLIGHT_TCXDCSTS_CLKDIV_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.CLKDIV */
#define IFX_MCDSLIGHT_TCXDCSTS_CLKDIV_OFF (9u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.NESTED_ISR */
#define IFX_MCDSLIGHT_TCXDCSTS_NESTED_ISR_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.NESTED_ISR */
#define IFX_MCDSLIGHT_TCXDCSTS_NESTED_ISR_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.NESTED_ISR */
#define IFX_MCDSLIGHT_TCXDCSTS_NESTED_ISR_OFF (11u)

/** \brief Length for Ifx_MCDSLIGHT_TCXCIP_Bits.CURRENT */
#define IFX_MCDSLIGHT_TCXCIP_CURRENT_LEN (31u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXCIP_Bits.CURRENT */
#define IFX_MCDSLIGHT_TCXCIP_CURRENT_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXCIP_Bits.CURRENT */
#define IFX_MCDSLIGHT_TCXCIP_CURRENT_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCXCFT_Bits.VSHRT_FCT */
#define IFX_MCDSLIGHT_TCXCFT_VSHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXCFT_Bits.VSHRT_FCT */
#define IFX_MCDSLIGHT_TCXCFT_VSHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXCFT_Bits.VSHRT_FCT */
#define IFX_MCDSLIGHT_TCXCFT_VSHRT_FCT_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXCFT_Bits.SHRT_FCT */
#define IFX_MCDSLIGHT_TCXCFT_SHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXCFT_Bits.SHRT_FCT */
#define IFX_MCDSLIGHT_TCXCFT_SHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXCFT_Bits.SHRT_FCT */
#define IFX_MCDSLIGHT_TCXCFT_SHRT_FCT_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCXPALLUTD_Bits.DATA */
#define IFX_MCDSLIGHT_TCXPALLUTD_DATA_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXPALLUTD_Bits.DATA */
#define IFX_MCDSLIGHT_TCXPALLUTD_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXPALLUTD_Bits.DATA */
#define IFX_MCDSLIGHT_TCXPALLUTD_DATA_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXPALLUTA_Bits.ADDR */
#define IFX_MCDSLIGHT_TCXPALLUTA_ADDR_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXPALLUTA_Bits.ADDR */
#define IFX_MCDSLIGHT_TCXPALLUTA_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXPALLUTA_Bits.ADDR */
#define IFX_MCDSLIGHT_TCXPALLUTA_ADDR_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_TCXPAL_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXPAL_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXPAL_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXPAL_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXPAL_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXPAL_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXPAL_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXPAL_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXPAL_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXPAL_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXPAL_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXPAL_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.OFFSET */
#define IFX_MCDSLIGHT_TCXPAL_MAP_OFFSET_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.OFFSET */
#define IFX_MCDSLIGHT_TCXPAL_MAP_OFFSET_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.OFFSET */
#define IFX_MCDSLIGHT_TCXPAL_MAP_OFFSET_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.GRAIN */
#define IFX_MCDSLIGHT_TCXPAL_MAP_GRAIN_LEN (3u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.GRAIN */
#define IFX_MCDSLIGHT_TCXPAL_MAP_GRAIN_MSK (0x7u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.GRAIN */
#define IFX_MCDSLIGHT_TCXPAL_MAP_GRAIN_OFF (28u)

/** \brief Length for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.EN */
#define IFX_MCDSLIGHT_TCXPAL_MAP_EN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.EN */
#define IFX_MCDSLIGHT_TCXPAL_MAP_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXPAL_MAP_Bits.EN */
#define IFX_MCDSLIGHT_TCXPAL_MAP_EN_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEA_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXEA_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEA_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXEA_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEA_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXEA_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXEA_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXEA_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXEA_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDSLIGHT_TCXWD_BND_BOUND_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDSLIGHT_TCXWD_BND_BOUND_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDSLIGHT_TCXWD_BND_BOUND_31_0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HBND_BOUND_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HBND_BOUND_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HBND_BOUND_63_32_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDSLIGHT_TCXWD_RNG_RANGE_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDSLIGHT_TCXWD_RNG_RANGE_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDSLIGHT_TCXWD_RNG_RANGE_31_0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HRNG_RANGE_63_32_LEN (32u)

