pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_bf.h
/** \brief Length for Ifx_MCDSLIGHT_TCYPALLUTA_Bits.ADDR */
#define IFX_MCDSLIGHT_TCYPALLUTA_ADDR_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYPALLUTA_Bits.ADDR */
#define IFX_MCDSLIGHT_TCYPALLUTA_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYPALLUTA_Bits.ADDR */
#define IFX_MCDSLIGHT_TCYPALLUTA_ADDR_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_TCYPAL_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYPAL_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYPAL_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYPAL_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYPAL_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYPAL_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYPAL_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYPAL_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYPAL_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYPAL_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYPAL_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYPAL_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.OFFSET */
#define IFX_MCDSLIGHT_TCYPAL_MAP_OFFSET_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.OFFSET */
#define IFX_MCDSLIGHT_TCYPAL_MAP_OFFSET_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.OFFSET */
#define IFX_MCDSLIGHT_TCYPAL_MAP_OFFSET_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.GRAIN */
#define IFX_MCDSLIGHT_TCYPAL_MAP_GRAIN_LEN (3u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.GRAIN */
#define IFX_MCDSLIGHT_TCYPAL_MAP_GRAIN_MSK (0x7u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.GRAIN */
#define IFX_MCDSLIGHT_TCYPAL_MAP_GRAIN_OFF (28u)

/** \brief Length for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.EN */
#define IFX_MCDSLIGHT_TCYPAL_MAP_EN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.EN */
#define IFX_MCDSLIGHT_TCYPAL_MAP_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYPAL_MAP_Bits.EN */
#define IFX_MCDSLIGHT_TCYPAL_MAP_EN_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEA_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYEA_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEA_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYEA_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEA_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYEA_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEA_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYEA_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEA_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYEA_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEA_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYEA_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDSLIGHT_TCYWD_BND_BOUND_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDSLIGHT_TCYWD_BND_BOUND_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDSLIGHT_TCYWD_BND_BOUND_31_0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HBND_BOUND_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HBND_BOUND_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HBND_BOUND_63_32_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDSLIGHT_TCYWD_RNG_RANGE_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDSLIGHT_TCYWD_RNG_RANGE_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDSLIGHT_TCYWD_RNG_RANGE_31_0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HRNG_RANGE_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HRNG_RANGE_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HRNG_RANGE_63_32_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDSLIGHT_TCYWD_MSK_MASK_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDSLIGHT_TCYWD_MSK_MASK_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDSLIGHT_TCYWD_MSK_MASK_31_0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HMSK_MASK_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HMSK_MASK_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDSLIGHT_TCYWD_HMSK_MASK_63_32_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.SIGN */
#define IFX_MCDSLIGHT_TCYWD_SGN_SIGN_LEN (6u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.SIGN */
#define IFX_MCDSLIGHT_TCYWD_SGN_SIGN_MSK (0x3fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.SIGN */
#define IFX_MCDSLIGHT_TCYWD_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.EITHER */
#define IFX_MCDSLIGHT_TCYWD_SGN_EITHER_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.EITHER */
#define IFX_MCDSLIGHT_TCYWD_SGN_EITHER_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.EITHER */
#define IFX_MCDSLIGHT_TCYWD_SGN_EITHER_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.BELOW */
#define IFX_MCDSLIGHT_TCYWD_SGN_BELOW_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.BELOW */
#define IFX_MCDSLIGHT_TCYWD_SGN_BELOW_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.BELOW */
#define IFX_MCDSLIGHT_TCYWD_SGN_BELOW_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.RELOAD */
#define IFX_MCDSLIGHT_TCYWD_SGN_RELOAD_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.RELOAD */
#define IFX_MCDSLIGHT_TCYWD_SGN_RELOAD_MSK (0xfu)

